
	var xkfl_1=new Array("A数理科学部","B化学科学部","C生命科学部","D地球科学部","E工程与材料科学部","F信息科学部","G管理科学部");
	
	var xkfl_2=new Array();
		xkfl_2[0]=new Array("A01 数学","A02 力学","A03 天文学","A04 物理学Ⅰ","A05 物理学Ⅱ");
		xkfl_2[1]=new Array("B01 无机化学","B02 有机化学","B03 物理化学","B04 高分子化学","B05 分析化学","B06 化学工程及工业化学","B07 环境化学");
		xkfl_2[2]=new Array("C01 基础生物学","C02 农业科学","C03 医学与药学");
		xkfl_2[3]=new Array("D01 地理学、土壤学和遥感","D02 地质学","D03 地球化学","D04 地球物理学和空间物理学","D05 大气科学","D06 海洋科学");
		xkfl_2[4]=new Array("E01 金属材料学科","E02 无机非金属材料科学","E03 有机高分子材料学科","E04 冶金与矿业学科",
			"E05 机械工程学科","E06 工程热物理与能源利用学科","E07 电工学科","E08 建筑环境与结构工程学科","E09 水利学科","E10 农业工程",
			"E11 林业工程","E12 食品工程","E13 纺织科学技术");
		xkfl_2[5]=new Array("F01 电子学与信息系统","F02 计算机科学","F03 自动化科学","F04 半导体科学","F05 光学和光电子学");
		xkfl_2[6]=new Array("G01 管理科学","G02 工商管理","G03 宏观管理与政策");
		
	var xkfl_3=new Array();
		xkfl_3[0]=new Array();
			xkfl_3[0][0]=new Array("A0101 基础数学","A0102 应用数学","A0103 计算数学与科学工程计算");
			xkfl_3[0][1]=new Array("A0201 一般力学","A0202 固体力学","A0203 流体力学","A0204 交叉与边缘领域的力学");
			xkfl_3[0][2]=new Array("A0301 宇宙学","A0302 星系和类星体","A0303 恒星物理与星际物质",
				"A0304 太阳和太阳系","A0305 射电天文","A0306 空间天文","A0307 理论天体物理","A0308 天体测量和天文地球动力学",
				"A0309 天体力学和人造卫星动力学","A0310 时间、频率","A0311 天文仪器","A0312 天文学史");
			xkfl_3[0][3]=new Array("A0401 凝聚态物性Ｉ：结构、力学和热学性质","A0402 凝聚态物性Ⅱ：电子结构、电学、磁学和光学性质",
				"A0403 原子和分子物理","A0404 光学");
			xkfl_3[0][4]=new Array("A0501 基础物理学","A0502 粒子物理学和场论","A0503 核物理","A0504 核技术及其应用",
				"A0505 粒子物理与核物理实验设备","A0506 等离子体物理");
			
		xkfl_3[1]=new Array();
			xkfl_3[1][0]=new Array("B0101 无机合成和制备化学","B0102 丰产元素化学","B0103 配位化学","B0104 生物无机化学","B0105 固体无机化学",
				"B0106 分离化学","B0107 物理无机化学","B0108 同位素化学","B0109 放射化学","B0110 核化学");
			xkfl_3[1][1]=new Array("B0201 有机合成","B0202 金属有机及元素有机化学","B0203 天然有机化学","B0204 物理有机化学","B0205 药物化学",
				"B0206 生物有机化学","B0207 有机分析","B0208 应用有机化学");
			xkfl_3[1][2]=new Array("B0301 结构化学","B0302 量子化学","B0303 催化","B0304 化学动力学","B0305 胶体与界面化学",
				"B0306 电化学","B0307 光化学","B0308 热化学","B0309 高能化学","B0310 计算化学");
			xkfl_3[1][3]=new Array("B0401 高分子合成","B0402 高分子反应","B0403 功能高分子","B0404 天然高分子",
				"B0405 高分子物理及高分子物理化学","B0406 高分子理论化学","B0407 聚合物工程及材料");
			xkfl_3[1][4]=new Array("B0501 色谱分析","B0502 电化学分析","B0503 光谱分析","B0504 波谱分析","B0505 质谱分析",
				"B0506 化学分析","B0507 热分析","B0508 放射分析","B0509 生化分析及生物传感","B0510 联用技术","B0511 采样、分离和富集方法",
				"B0512 化学计量学","B0513 表面、微区、形态分析");
			xkfl_3[1][5]=new Array("B0601 化工热力学和基础数据","B0602 传递过程","B0603 分离过程及设备","B0604 化学反应工程",
				"B0605 化工系统工程","B0606 无机化工","B0607 有机化工","B0608 生物化工与食品化工","B0609 能源化工","B0610 化工冶金",
				"B0611 环境化工",	"B0612 制药工程");
			xkfl_3[1][6]=new Array("B0701 环境分析化学","B0702 环境污染化学","B0703 污染控制化学","B0704 污染生态化学","B0705 理论环境化学",
				"B0706 全球性环境化学问题");
			
		xkfl_3[2]=new Array();
			xkfl_3[2][0]=new Array("C0101 微生物学","C0102 植物学","C0103 动物学","C0104 生物化学和分子生物学",
				"C0105 生物物理学与生物医学工程学","C0106 神经生物学","C0107 生理学","C0108 心理学","C0109 细胞生物学及发育生物学","C0110 遗传学");
			xkfl_3[2][1]=new Array("C0201 农业基础科学","C0202 农学","C0203 畜牧、兽医学","C0204 蚕桑、养蜂学","C0205 水产学","C0206 林学");
			xkfl_3[2][2]=new Array("C0301 预防医学与卫生学","C0302 基础医学","C0303 临床医学","C0304 药物学","C0305 中医中药学");
			
		xkfl_3[3]=new Array();
			xkfl_3[3][0]=new Array("D0101 综合自然地理学","D0102 地貌学","D0103 应用气候学","D0104 水资源与水文学","D0105 冰雪、冻土学",
				"D0106 经济地理学（含历史地理学）","D0107 城市地理学","D0108 生物地理学","D0109 区域地理","D0110 区域可持续发展","D0111 土壤地理学",
				"D0112 土壤物理学","D0113 土壤化学","D0114 土壤生物学","D0115 土壤肥力","D0116 土壤侵蚀与水土保持","D0117 遥感成像机理",
				"D0118 遥感信息处理","D0119 遥感信息模型与方法","D0120 资源环境信息系统","D0121 测绘学","D0122 污染物表生行为及环境效应",
				"D0123 区域环境质量演变","D0124 人类活动与环境效应","D0125 环境演变与对策");
			xkfl_3[3][1]=new Array("D0201 古生物学（含古人类学）","D0202 地层学（含磁性地层学）","D0203 矿物学","D0204 岩石学",
				"D0205 矿床学","D0206 沉积学（含现代沉积、沉积地球化学、有机地球化学）","D0207 石油、天然气地质学","D0208 煤田地质学",
				"D0209 第四纪地质学","D0210 前寒武纪地质学与变质地质学","D0211 构造地质学","D0212 大地构造学","D0213 水文地质学",
				"D0214 工程地质学","D0215 数学地质学","D0216 地热地质学","D0217 遥感地质","D0218 环境地质");
			xkfl_3[3][2]=new Array("D0301 同位素地球化学","D0302 微量元素地球化学","D0303 岩石地球化学","D0304 矿床地球化学（含有机地球化学）",
				"D0305 同位素年代学","D0306 实验地球化学","D0307 天体化学与比较行星学","D0308 地球化学新技术、新方法","D0309 环境地球化学与生物地球化学");
			xkfl_3[3][3]=new Array("D0401 大地测量学（物理大地测量、动力大地测量）","D0402 地震学","D0403 地磁学（含古地磁学）",
				"D0404 电磁学（电磁测深）","D0405 重力学","D0406 地热学(大地热流)","D0407 深部地球物理","D0408 地球动力学","D0410 空间物理",
				"D04101 高层大气物理学","D04102电离层物理学","D04103 磁层物理学","D04104 行星际物理学","D04105 宇宙线物理学",
				"D0411 地球物理实验与仪器","D0412 空间环境科学");
			xkfl_3[3][4]=new Array("D0501 大气物理学","D0502 大气边界层物理和大气湍流","D0503 大气遥感和大气探测","D0504 中层大气物理学",
				"D0505 天气学","D0506 大气动力学","D0507 气候学","D0508 数值天气预报和数值模拟","D0509 应用气象学","D0510 大气化学",
				"D0511 行星大气学","D0512 大气环境","D0513 气象仪器");
			xkfl_3[3][5]=new Array("D0601 物理海洋学","D0602 海洋物理学","D0603 海洋地质学","D0604 海洋化学",
				"D0605 河口海岸学","D0606 工程海洋学","D0607 海洋监测、调查技术（含其它海洋技术）",
				"D0608 海洋环境科学（含与海洋有关的全球变化研究等）","D0609 生物海洋学（含生物海洋技术）","D0610 海洋遥感");
				
		xkfl_3[4]=new Array();
			xkfl_3[4][0]=new Array("E0101 金属结构材料及制备基础","E0102 金属基复合材料及制备基础","E0103 金属非晶态、准晶和纳米晶材料及制备基础",
				"E0104极端（指超高温、超高压、强辐照等等）条件下使用的金属材料","E0105金属功能材料（不包括信息、光电子、光学和半导体材料）",
				"E0106 金属材料的合金相图、相变及合金设计","E0107 金属材料的结构与缺陷","E0108 金属材料的形变与断裂",
				"E0109 金属材料的凝固与结晶学","E0110 表面改性中有关金属材料的科学问题","E0111 金属腐蚀与防护","E0112 金属磨损与磨蚀");
			xkfl_3[4][1]=new Array("E0201 人工晶体","E0202 玻璃材料","E0203 结构陶瓷","E0205 水泥与耐火材料","E0206 碳素材料与超硬材料",
				"E0207 无机涂层及薄膜","E0208 无机非金属基复合材料","E0209 无机非金属类半导体材料","E0210 无机非金属类电介质与电解质材料",
				"E0211 无机非金属类磁性材料","E0212 古陶瓷与传统陶瓷");
			xkfl_3[4][2]=new Array("E0301 塑料、橡胶、纤维","E0302 聚合物基复合材料","E0303 功能高分子材料","E0304 多组分多相高分子材料",
				"E0305 高分子型助剂","E0306 胶粘剂","E0307 涂料","E0308 高分子液晶材料","E0309 高分子耐磨和自润滑材料",
				"E0310 耐高温、耐腐蚀、耐烧蚀高分子材料","E0311 元素及金属有机材料");
			xkfl_3[4][3]=new Array("E0401 矿物资源开采","E0402 矿物资源工程","E0403 冶金物理化学及其应用","E0404 冶金反应工程学与系统工程",
				"E0405 特殊冶金与材料制备工程","E0406 钢铁冶金、金属精炼、现代冶金铸轧","E0407 有色金属冶金与分离工程","E0408 粉体工程与粉末冶金",
				"E0409 冶金环境工程","E0410 其它");
			xkfl_3[4][4]=new Array("E0501 机械学","E0502 机械制造");
			xkfl_3[4][5]=new Array("E0601 工程热力学","E0602 热流体力学","E0603 传热传质学","E0604 燃烧学","E0605 热物性与热物理测试技术",
				"E0606 新能源利用","E0607 两相与多相热物理学","E0608 热力系统动态特性学","E0609 其它");
			xkfl_3[4][6]=new Array("E0701 电工基础理论","E0702 电机学","E0703 电器学","E0704 电力系统","E0705 绝缘与高电压",
				"E0706 电力电子","E0707 电工新技术基础","E0708 电工测量及仪器","E0709 电力电磁兼容","E0710 超导电工技术","E0711 电加工",
				"E0712 静电技术");
			xkfl_3[4][7]=new Array("E0801 建筑工程数学与力学","E0802 建筑系统工程学","E0803 建筑学","E0804 城乡规划学",
				"E0805 建筑物理学","E0806 环境工程学","E0807 结构工程学","E0808 地基与基础工程学","E0809 交通工程学",
				"E0810 防灾工程学","E0811 建筑材料学","E0812 建筑施工与管理学");
			xkfl_3[4][8]=new Array("E0901 水工结构","E0902 水力学","E0903 水文、水资源","E0904 河流、海岸动力学及泥沙研究",
				"E0905 岩土力学及地基基础","E0906 环境水利","E0907 农田水利","E0908 水工新材料","E0909 水力机械");
			xkfl_3[4][9]=new Array("E1001农业机械学（含农业机械制造等）","E1002 农业机械化","E1003 农业电气化与自动化","E1004水土保持学",
				"E1005农田测量","E1006农业环保工程","E1007 农业区划","E1008 农业系统工程","E1009 农业工程其它学科");
			xkfl_3[4][10]=new Array("E1101 森林采运学","E1102 林业机械","E1103林业机械化与自动化","E1104 木材学",
				"E1105木材加工与人造板工艺学（含家具设计与制造）","E1106 木材防腐学","E1107 林产化学加工学","E1108 林业工程其它学科");
			xkfl_3[4][11]=new Array("E1201 食品科学技术基础","E1202 食品加工技术","E1203 食品包装与储藏","E1204 食品机械",
				"E1205 食品加工的副产品加工与利用");
			xkfl_3[4][12]=new Array("E1301 纺织科学技术基础","E1302 纺织材料","E1303 纤维制造技术","E1304 纺织技术",
				"E1305 染整技术","E1306 服装技术","E1307 纺织机械与设备");
		
		xkfl_3[5]=new Array();
			xkfl_3[5][0]=new Array("F0101 信息理论与信息系统","F0102 信号理论与信号处理","F0103 电路与系统","F0104 电磁场与微波技术",
				"F0105 电子离子物理、材料与器件","F0106 生物电子学");
			xkfl_3[5][1]=new Array("F0201 理论计算机科学","F0202 计算机软件","F0203 计算机系统结构","F0204 计算机外围设备技术",
				"F0205 计算机应用基础研究","F0206 中国语言文字信息处理");
			xkfl_3[5][2]=new Array("F0301 控制理论","F0302 工程系统与控制","F0303 系统科学与系统工程","F0304 模式信息处理",
				"F0305 智能系统与知识工程","F0306 机器人学及机器人技术");
			xkfl_3[5][3]=new Array("F0401 半导体材料","F0402 微电子学","F0403 半导体光电子学","F0404 半导体其它器件",
				"F0405 半导体物理","F0406 半导体化学","F0407 半导体理化分析");
			xkfl_3[5][4]=new Array("F0501 光学信息处理","F0502 光电子器件","F0503 光信息传输","F0504 激光","F0505 非线性光学",
				"F0506 红外技术","F0507 光谱技术","F0508 技术光学","F0509 光学和光电子材料","F0510 交叉学科中的光学问题");
			
		xkfl_3[6]=new Array();
			xkfl_3[6][0]=new Array("G0101 管理科学与管理思想史","G0102 一般管理理论","G0103 运筹与管理","G0104 决策与对策理论",
				"G0105 组织理论","G0106 管理心理与行为理论","G0107 管理系统工程","G0108 评估技术","G0109 预测技术",
				"G0110 数量经济分析方法","G0111 工业工程","G0112 信息技术与管理","G0113 复杂性研究");
			xkfl_3[6][1]=new Array("G0201 企业理论","G0202 企业战略管理","G0203 会计理论与方法","G0204 财务管理",
				"G0205 市场营销","G0206 运作管理","G0207 项目管理","G0208 人力资源管理","G0209 技术经济与技术管理","G0210 企业文化");
			xkfl_3[6][2]=new Array("G0301 宏观经济战略与管理","G0302 公共管理与公共政策","G0303 金融管理","G0304 财税管理",
				"G0305 农林经济管理","G0306 产业与行业管理","G0307 科技管理与科技政策","G0308 信息资源管理",
				"G0309 资源与环境管理","G0310 区域发展与管理");